_posts_bak/2021-12-27-boj-4195.html
---
layout: post
title: BOJ 4195 친구 네트워크
tags: UnionFind
---

<div id="outline-container-orgb532cbd" class="outline-2">
<h2 id="orgb532cbd">BOJ 4195 친구 네트워크</h2>
<div class="outline-text-2" id="text-orgb532cbd">
<ul class="org-ul">
<li>Union Find를 이용하는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-orgda5b563" class="outline-2">
<h2 id="orgda5b563">접근하기</h2>
<div class="outline-text-2" id="text-orgda5b563">
<ul class="org-ul">
<li>집합의 크기를 어떻게 사용하는지 배우는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-org37f5dd6" class="outline-2">
<h2 id="org37f5dd6">코드</h2>
<div class="outline-text-2" id="text-org37f5dd6">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;map&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p</span>[200010];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">Union_find_init</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n</span>)
{
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;n*2;i++) {
        p[i] = -1;
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">Find</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (p[a] &lt; 0) <span style="color: #729fcf; font-weight: bold;">return</span> a;
    <span style="color: #729fcf; font-weight: bold;">return</span> p[a] = Find(p[a]);
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">Union</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b</span>)
{
    a = Find(a);
    b = Find(b);

    <span style="color: #729fcf; font-weight: bold;">if</span> (a != b) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (p[a] &lt;= p[b]) {
            p[a] += p[b];
           p[b] = a;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            p[b] += p[a];
            p[a] = b;        
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">solve</span>()
{
    <span style="color: #8ae234; font-weight: bold;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">mp</span>;
    cin &gt;&gt; N;
    Union_find_init(N);    

    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">name1</span>, <span style="color: #ff6347;">name2</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        cin &gt;&gt; name1 &gt;&gt; name2;
        <span style="color: #729fcf; font-weight: bold;">if</span> (mp[name1] == 0) {
            mp[name1] = ++idx;
        }

        <span style="color: #729fcf; font-weight: bold;">if</span> (mp[name2] == 0) {
            mp[name2] = ++idx;
        }

        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = mp[name1];
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n2</span> = mp[name2];
        Union(n1, n2);
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt1</span> = Find(n1);
        cout &lt;&lt; -p[cnt1]  &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234;">ios</span>::sync_with_stdio(0);
    cin.tie(0);
    cin &gt;&gt; T;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tc</span>=1;tc&lt;=T;tc++) {
        solve();
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebc6e6b" class="outline-2">
<h2 id="orgebc6e6b">문제 링크</h2>
<div class="outline-text-2" id="text-orgebc6e6b">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/4195">https://www.acmicpc.net/problem/4195</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb327339" class="outline-2">
<h2 id="orgb327339">참고자료</h2>
<div class="outline-text-2" id="text-orgb327339">
<ul class="org-ul">
<li><a href="https://greatzzo.tistory.com/52">https://greatzzo.tistory.com/52</a></li>
</ul>
</div>
</div>
